Reports/ххх_Бонусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Report>
		<Properties>
			<Name>ххх_Бонусы</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ххх_БонусыИстория.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ххх_БонусыИстория</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоПродаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентНАценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапасВДнях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОстатокВЦенахЗакупа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаРозницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЗакупа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ххх_Бонусы/Ext/ManagerModule.bsl
Процедура СформироватьОтчет(ПараметрыОтчета, АдресХранилища) Экспорт
		
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач",ПараметрыОтчета.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",ПараметрыОтчета.Период.ДатаОкончания);
	Запрос.Текст="ВЫБРАТЬ
	             |	МАКСИМУМ(ххх_БонусыИстория.Дата) КАК Дата,
	             |	ххх_БонусыИстория.Номенклатура КАК Номенклатура,
	             |	СУММА(ххх_БонусыИстория.СуммаСкидки) КАК СуммаСкидки,
	             |	СУММА(ххх_БонусыИстория.СуммаПроданного) КАК СуммаПроданного,
	             |	СУММА(ххх_БонусыИстория.КоличествоПродано) КАК КоличествоПродано
	             |ПОМЕСТИТЬ СрезПоследних
	             |ИЗ
	             |	РегистрСведений.ххх_БонусыИстория КАК ххх_БонусыИстория
	             |ГДЕ
	             |	ххх_БонусыИстория.Дата МЕЖДУ &ДатаНач И &ДатаКон
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ххх_БонусыИстория.Номенклатура
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ххх_БонусыИсторияСрезПоследних.Дата КАК Период,
	             |	ххх_БонусыИсторияСрезПоследних.Поставщик КАК Поставщик,
	             |	ххх_БонусыИсторияСрезПоследних.Номенклатура КАК Номенклатура,
	             |	СрезПоследних.КоличествоПродано КАК КоличествоПродано,
	             |	СрезПоследних.СуммаПроданного КАК СуммаПроданного,
	             |	СрезПоследних.СуммаСкидки КАК СуммаСкидки,
	             |	ххх_БонусыИсторияСрезПоследних.ЦенаЗакупа КАК ЦенаЗакупа,
	             |	ххх_БонусыИсторияСрезПоследних.ЦенаРозницы КАК ЦенаРозницы,
	             |	ххх_БонусыИсторияСрезПоследних.Остаток КАК Остаток,
	             |	ххх_БонусыИсторияСрезПоследних.ЦенаЗакупа * ххх_БонусыИсторияСрезПоследних.Остаток КАК ОстатокВЦенахЗакупа,
	             |	ВЫБОР
	             |		КОГДА СрезПоследних.КоличествоПродано = 0
	             |			ТОГДА 0
	             |		ИНАЧЕ ххх_БонусыИсторияСрезПоследних.Остаток / СрезПоследних.КоличествоПродано
	             |	КОНЕЦ КАК ЗапасВДнях,
	             |	СрезПоследних.СуммаПроданного - ххх_БонусыИсторияСрезПоследних.ЦенаЗакупа * СрезПоследних.КоличествоПродано КАК Прибыль,
	             |	ВЫБОР
	             |		КОГДА ххх_БонусыИсторияСрезПоследних.ЦенаЗакупа = 0
	             |				ИЛИ СрезПоследних.КоличествоПродано = 0
	             |			ТОГДА 0
	             |		ИНАЧЕ СрезПоследних.СуммаПроданного / (ххх_БонусыИсторияСрезПоследних.ЦенаЗакупа * СрезПоследних.КоличествоПродано) - 1
	             |	КОНЕЦ КАК ПроцентПрибыли,
	             |	ВЫБОР
	             |		КОГДА ххх_БонусыИсторияСрезПоследних.ЦенаЗакупа = 0
	             |			ТОГДА 0
	             |		ИНАЧЕ ВЫРАЗИТЬ(ххх_БонусыИсторияСрезПоследних.ЦенаРозницы / ххх_БонусыИсторияСрезПоследних.ЦенаЗакупа - 1 КАК ЧИСЛО(15, 2))
	             |	КОНЕЦ КАК ПроцентНаценки,
	             |	СрезПоследних.КоличествоПродано * ххх_БонусыИсторияСрезПоследних.ЦенаЗакупа КАК СуммаЗакупа,
	             |	ВЫБОР
	             |		КОГДА СрезПоследних.КоличествоПродано <> 0
	             |			ТОГДА 1
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК КоличествоПродажSKU,
	             |	СрезПоследних.Номенклатура.Производитель КАК НоменклатураПроизводитель
	             |ИЗ
	             |	РегистрСведений.ххх_БонусыИстория КАК ххх_БонусыИсторияСрезПоследних
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СрезПоследних КАК СрезПоследних
	             |		ПО ххх_БонусыИсторияСрезПоследних.Дата = СрезПоследних.Дата
	             |			И ххх_БонусыИсторияСрезПоследних.Номенклатура = СрезПоследних.Номенклатура
	             |ГДЕ
	             |	ххх_БонусыИсторияСрезПоследних.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	
	ПоместитьВоВременноеХранилище(Запрос.Выполнить().Выгрузить(), АдресХранилища);
	
КонецПроцедуры
